Revit 2026 API

# AssemblyViewUtilsCreateMaterialTakeoff Method

---

|  | Name | Description |
| --- | --- | --- |
|  | CreateMaterialTakeoff(Document, ElementId) | Creates a new material takeoff multicategory schedule assembly view for the assembly instance. |
|  | CreateMaterialTakeoff(Document, ElementId, ElementId, Boolean) | Creates a new material takeoff multicategory schedule assembly view for the assembly instance. |

#### Reference

AssemblyViewUtils Class

Autodesk.Revit.DB Namespace